package days15;

/**
 * @author dnb
 * @date 2024. 7. 19. - 오후 2:47:00
 * @subject		[인터페이스(interface)]
 * @content
 *
 */
public class Ex07 {

	public static void main(String[] args) {
		/*
		 * [인터페이스]
		 * 1.	자바 자료형 - 참조타입 : 배열, 클래스, [인터페이스]
		 * 2.	일종의 추상클래스이다.
		 * 3.	필드를 선언할수 없다
		 * 		일반 메서드 선언할수 없다.
		 * 
		 * 		상수만 선언할수 있다.
		 * 		추상 메서드만 선언 할 수 있다.
		 * 		 +
		 * 		[jdk 1.8 추가]
		 * 		static 메서드 
		 * 		default 메서드
		 * 4.	추상클래스 - 미완성 설계도					-> 구현한 자식 클래스
		 * 		인터페이스 - (밑그림만 그려져있는) 기본 설계도		-> 구현한 자식 클래스
		 *		: 그 자체만으로 사용되기 보다는 다른 클래스를 작성하는데 도움을 주는 목적으로 사용된다. 
		 * 5.	인터페이스 선언 형식
		 * 		[public or default] interface [인]터페이스이름{ *추상클래스이기때문에 대문자로 시작한다. 
		 *		상, 추메,d메, s메
		 *		}
		 * 6.	인터페이스 안의 모든 멤버는
		 * 		public static final 생략
		 * 		public abstract 생략
		 * 7.	인터페이스 끼리 상속이 가능하다.
		 * 		(extands 키워드 사용)
		 * 8.	인터페이스를 사용하면 다중 상속이 가능하다.
		 * 9.	클래스 implements(구현한) 인터페이스
		 * 10.	인터페이스의 장점.
		 * 		1) 개발 시간 단축 시킬수 있다.
		 * 		매서드 호출해서 사용 가능.
		 * 		2) 표준화가 가능
		 * 		3) 서로 관계없는 클래스들 일지라도 관계를 맺어줄수 있다.
		 * 		4) 독립적인 프로그램이 가능하다. 
		 * 
		 * */
		
	}//main

}//class


